stock_ex/stock_api/app/controllers/prices_controller.rb

  def create
    @price = Price.new(price_params)
    @price.stock_id = params[:stock_id]

    if @price.save
---
INSERT INTO "prices" ("average_amount", "created_at", "updated_at", "stock_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["average_amount", "140.67"], ["created_at", "2020-05-02 20:24:54.390610"], ["updated_at", "2020-05-02 20:24:54.390610"], ["stock_id", 1]]