stock_ex/stock_api/app/controllers/stocks_controller.rb

  def show
    @stock = Stock.find(params[:id])
---
SELECT "stocks".* FROM "stocks" WHERE "stocks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]