books_app_api/app/controllers/books_controller.rb

    def index
        book = Book.all
---
SELECT "books".* FROM "books"

    def show
        found_book = Book.find(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]

    def update
        book = Book.find(params[:id])
        book.update(book_params)
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "books" SET "title" = $1, "author" = $2, "genre" = $3, "publisher" = $4, "updated_at" = $5 WHERE "books"."id" = $6  [["title", "Cool book"], ["author", "Loki"], ["genre", "Fiction"], ["publisher", "Aarik's Book"], ["updated_at", "2020-04-25 19:38:56.418589"], ["id", 3]]

    def destroy
        book = Book.destroy(params[:id])
---
DELETE FROM "books" WHERE "books"."id" = $1  [["id", 1]]