song_app_api/app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs"
---
    def index
        songs = Songs.all

SELECT "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
            song = Songs.find(params[:id])

INSERT INTO "songs" ("title", "artist_name", "artwork") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Song2"], ["artist_name", "Aarik"], ["artwork", "None"]]
---
    def create
        song = Songs.new(song_params)
        if song.save

SELECT "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def update
        song = Songs.find(params[:id])

DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 3]]
---
    def destroy
        song = Songs.destroy(params[:id])