temperatures/temperatures_api/app/controllers/temperatures_controller.rb

  def create
    @temperature = Temperature.new(temperature_params)
    @temperature.location_id = params[:location_id]

    if @temperature.save
---
INSERT INTO "temperatures" ("average_high_f", "average_low_f", "month", "created_at", "updated_at", "location_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["average_high_f", 46], ["average_low_f", 39], ["month", "January"], ["created_at", "2020-05-02 16:22:22.721324"], ["updated_at", "2020-05-02 16:22:22.721324"], ["location_id", 2]]